app/controllers/blogs_controller.rb

  def index
    # 記事を全件取得
      @blogs = Blog.all
---
SELECT "blogs".* FROM "blogs"

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "test6"], ["category", "test6"], ["body", "test6"], ["updated_at", "2020-01-13 07:37:54.908001"], ["id", 1]]